{
    "version": "https://jsonfeed.org/version/1",
    "title": "Foyer Design System",
    "description": "",
    "home_page_url": "https://www.design.foyer.lu/blog",
    "feed_url": "https://www.design.foyer.lu/blog/feed.json",
    "user_comment": "",
    "icon": "https://www.design.foyer.lu/blog/media/website/fds-logo.svg",
    "author": {
        "name": "Geoffrey Crofte"
    },
    "items": [
        {
            "id": "https://www.design.foyer.lu/blog/user-task-canvas-collect-your-users-needs-and-activities.html",
            "url": "https://www.design.foyer.lu/blog/user-task-canvas-collect-your-users-needs-and-activities.html",
            "title": "User Task Canvas – Collect your users’ needs &amp; activities",
            "summary": "<p>It is not always easy to collect all of your users’ needs, especially when you are not necessarily familiar with the context of use or the field in which they work. That’s why we created this downloadable and printable canvas to help you collect needs.</p>\n",
            "content_html": "<p>It is not always easy to collect all of your users’ needs, especially when you are not necessarily familiar with the context of use or the field in which they work. That’s why we created this downloadable and printable canvas to help you collect needs.</p>\n\n<h2 id=\"mcetoc_1ec272boc0\">Context of the research</h2>\n<p><a href=\"https://www.linkedin.com/in/julie-muller-128ab440/\" target=\"_blank\" rel=\"noopener noreferrer\">Julie</a> and I (<a href=\"https://twitter.com/geoffreycrofte\" target=\"_blank\" rel=\"noopener noreferrer\">Geoffrey</a>) occasionnaly work for <a href=\"https://www.capitalatwork.com/\">CapitalatWork Foyer Group</a>, a discretionary investment management company. The goal of our intervention was to understand why their existing tools did not meet the needs of the portfolio managers (our end users).</p>\n<p>But before we could address the question of “why”, we needed to better understand the context and identify their work habits while understanding their daily lives. Thus, we would have bits of “what”, “who” and “how” that would most certainly allow us to find leads on the “why”.</p>\n<p>We wanted to make it easier for our users, and bring a bit of fun too. We looked at creating a card game fast enough to help our managers work with us on this exercise.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-card-prototype@2x.jpg\" alt=\"The first prototype we tested on a colleague\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7009\" class=\"wp-caption-text\">The first prototype we tested on a colleague</figcaption>\n</figure>\n<p>We had one day to conceptualize them, pre-test them, make them, print them, cut them out and test them the next day.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-first-print@2x.jpg\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7011\" class=\"wp-caption-text\">The prototype tested on the left, the first set printed on the right</figcaption>\n</figure>\n<h2 id=\"cards\">Context of use of our <span lang=\"en\">User Task Cards</span></h2>\n<p>To help our managers, we organized a small workshop with two of our end users, blocked 1 hour for the exercise. In hindsight, the time was not enough and we overran by 15 minutes, where it would have taken 1h30 instead.</p>\n<h3 id=\"mcetoc_1ec27a6o91\">Introduce the concept</h3>\n<p>When you do something unusual with your users, it is important to introduce the context.</p>\n<ol>\n<li>Remind the context of the workshop (collecting their work habits)</li>\n<li>Announce that you will use cards to help them.</li>\n<li>Introduce the cards : <span lang=\"en\">Task</span>, <span lang=\"en\">Actions</span>/<span lang=\"en\">Decisions</span>, <span lang=\"en\">Objects</span>/<span lang=\"en\">Tools</span>, <span lang=\"en\">Interactions</span>/<span lang=\"en\">Dependencies</span>. We voluntarily did not introduce the <span lang=\"en\">Pain Points</span>, <span lang=\"en\">Magic Changes</span> and Meta-cards right away (they’re not all here in the previous images, by the way.) .</li>\n<li>Then present an example that is quite simple to understand from everyday life. We used the example of “Taking a shower” which generally speaks to all our users.</li>\n</ol>\n<p>When you run your example you need to remind yourself what each card implies and propose an order to present these cards. Order that will not necessarily be respected by your users and that’s totally fine.</p>\n<ol>\n<li><span lang=\"en\"><strong>Task</strong></span> : this is the task you need to perform. You normally filled in this card with a “I need to take a shower”.</li>\n<li><strong><span lang=\"en\">Actions</span>/</strong><span lang=\"en\"><strong>Decisions</strong></span> : it is about defining what you do to accomplish this task, and the decisions you need to make to accomplish the task. “I turn on the water”, “I wait for the hot water”, “I adjust the type of jet”, are possible options.</li>\n<li><strong><span lang=\"en\">Tools</span>/</strong><span lang=\"en\"><strong>Objects</strong></span> : it is about specifying the tools and objects that you use to accomplish the task. “A washcloth”, “soap”, “a sponge” or “a towel” can be useful objects.</li>\n<li><strong><span lang=\"en\">Interactions</span>/</strong><span lang=\"en\"><strong>Dependencies</strong></span> : it is about providing more context to your task by reminding yourself of the people or other activities on which you depend. “The boilers”, “The cleanliness of the towel”, “The good maintenance of the siphon” can be dependencies.</li>\n</ol>\n<p>Our initial mistake was to think that our users could fill out the cards <span lang=\"en\">Pain Points</span> and <span lang=\"en\">Magic Changes</span> later. In fact, they needed to express what bothers them early on. Give them this card early on by presenting it at the beginning, preserve the card <span lang=\"en\">Magic Changes</span> for later.</p>\n<ol start=\"5\">\n<li><span lang=\"en\"><strong>Pain Points</strong></span> : it represents the blocking or irritating points during the performance of the task. Usually it fills almost all by itself when you talk about tools, objects, interactions and dependencies. “Shower slips”, “Water is cold”, “Moisture rises quickly” can be pain points.</li>\n</ol>\n<h3 id=\"cards-workshop\">Conduct of the workshop</h3>\n<p>Once the presentations were made, we suggested that managers complete a few task cards to list them.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-listing-activities@2x-1.jpg\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7023\" class=\"wp-caption-text\">Users filling in task cards</figcaption>\n</figure>\n<p>However, as they filled them out, they remembered the dependencies and tools they use. We ended up giving them free access to all the cards so that they could express themselves freely. They quickly took the tool in hand. We started making them work together.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-activities-columns@2x-1.jpg\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7017\" class=\"wp-caption-text\">Columns of tasks and their context</figcaption>\n</figure>\n<p>In order to help them, we completed, while listening to them, the meta-cards, which offer more context to a given task. We only had the “Rhythm” card at that time, but we quickly realized the need for the “Where” and the duration.</p>\n<p>After a while, and because sometimes someone may take the lead in the group, we ended up separating the two managers to get more tasks and allow everyone to use their own memory.</p>\n<p>At the end of the workshop, we offered the “Magic Changes” card so that the user could imagine their own solution for the Pain Points encountered. At that time we took the example of the shower to present the concept to them. “Having a small auxiliary water-heater”, “Porous shower floor” or “motorized ventilation” can be solutions to the pain points in our shower story.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-activities-prioritized@2x-1.jpg.webp\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7021\" class=\"wp-caption-text\">Many more tasks organized by columns</figcaption>\n</figure>\n<p>Once it’s done, group your columns into small stacks for quick access to task information. We used small <a href=\"https://amzn.to/2PGyR4U\" hreflang=\"fr\">wooden clamps</a> that are much more practical than paper clips here.</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-activities-grouped@2x-1.jpg\" width=\"1600\" height=\"900\">\n<figcaption id=\"figcaption_attachment_7019\" class=\"wp-caption-text\">Stacks of our users’ tasks</figcaption>\n</figure>\n<p>We obviously had not anticipated everything for this workshop, so here are some additional tips.</p>\n<h3 id=\"mcetoc_1ec27ehgg2\">Some tips for this workshop</h3>\n<p>These tips are quite generic. Depending on your users and the context of your work, you will certainly need to adapt the exercise a little. A few things we have seen.</p>\n<ul>\n<li>Plan at least 1h30 with two users working with you,</li>\n<li>Be at least 2 designers, it’s easier to support users and not forget anything. Especially if you want to take notes during the session,</li>\n<li>Present all cards from the beginning, including Pain Points, but except the Magic Changes card, which should be kept for the end.</li>\n<li>Arrange tasks by column or row to facilitate the completion of each task.</li>\n<li>You can help to fill in the context cards: “duration”, “where”, “rhythm” without any risk while listening to your users.</li>\n<li>Your users will probably highjack the game and do what they want with it. Unless you lose too much material because of this hacking, let them do it and be flexible. The important thing is to make it more fun for them and to create an automatism while not forgetting anything.</li>\n</ul>\n<h3 id=\"mcetoc_1ec27ehgg3\">Experience feedback</h3>\n<p>At <a href=\"https://www.foyer.lu/en\">Foyer</a>, we work in an Agile context. We develop features piece by piece, and we test them at each iteration with our end users. Each development comes from a need that we discovered thanks to this workshop and a proper <a href=\"https://www.productplan.com/glossary/story-mapping/\">story mapping</a>.</p>\n<p>After a few months of development and several weeks of use, the feedback is more than positive and the adoption of the tool is unequivocal: excellent. One of the many verbatim comments from our users that has brought me the most as a researcher is:</p>\n<blockquote>\n<p>It’s surprising, you’ve managed to understand our business without knowing anything about it at first.<br> — a user</p>\n</blockquote>\n<h3 id=\"cards-dl\">Download the User Task Cards for free</h3>\n<p>You will find the latest version of the cards available for free here. Be aware of <a href=\"https://www.creativejuiz.fr/blog/en/resources-tools/user-task-canvas-collect-users-activities-tasks-needs#license\">the license</a>.</p>\n<p> </p>\n<p><img class=\"post__image--wide\" src=\"https://www.creativejuiz.fr/blog/wp-content/uploads/2019/12/user-task-canvas-cards-cover@2x.jpg\" width=\"885\" height=\"626\"></p>\n<p class=\"align-center\"><a href=\"https://www.creativejuiz.fr/blog/en/resources-tools/user-task-canvas-collect-users-activities-tasks-needs#mc_embed_signup\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Get the kit from another website\">Download the kit</a></p>\n<p>This is a version 1.0 that I will update over time based on the feedback and improvements that we receive.</p>\n<h2 id=\"license\">License of the files</h2>\n<p>Some simple rules to respect. Those files are under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">CC SA-BY 4.0 License</a>. Thanks for reading the details of the license and the following:</p>\n<ul>\n<li>You can use these files freely and without charge, even in a commercial context.</li>\n<li>You can modify and adapt these files, but you are required to specify the modifications made in order not to assign them to the original authors.</li>\n<li>You are required to cite the original authors of these files (Julie Muller, Stéphanie Walter, and Geoffrey Crofte) and to link to this article or the link at the bottom of the page of the downloadable PDFs.</li>\n<li>You are required to share your creation and modifications under the same license.</li>\n<li>You are not allowed to apply legal conditions or technical measures that would legally restrict others to use the Work under the conditions described in the license.</li>\n</ul>\n<p>Thanks for us and have fun!</p>",
            "image": "https://www.design.foyer.lu/blog/media/posts/1/user-task-listing-activities2x-1.jpg",
            "author": {
                "name": "Geoffrey Crofte"
            },
            "tags": [
            ],
            "date_published": "2020-06-30T11:45:55+02:00",
            "date_modified": "2020-06-30T11:45:55+02:00"
        }
    ]
}
